# Brewfile

# Taps
# tap 'homebrew/cask-drivers' # deprecated
tap 'thoughtbot/formulae'
tap 'homebrew-ffmpeg/ffmpeg'
tap 'homebrew/cask-versions'
tap 'lvnilesh/tap'
tap 'mongodb/brew'
tap 'fluxcd/tap'
tap 'weaveworks/tap'
tap 'oven-sh/bun'

# Packages
brew 'git'
brew 'diff-so-fancy'
brew 'asciidoctor'
brew 'iperf3'
brew 'jq'
brew 'yq'
brew 'k9s'
brew 'tldr'
# brew 'yubico-piv-tool'
brew 'mas'
brew 'rcm'
brew 'nvm'
brew 'grc'
brew 'duti'
brew 'webp'
# brew 'kubectx'
brew 'nvm'
brew 'autojump'
brew 'lvnilesh/tap/kubecolor'
# brew 'zsh-syntax-highlighting'
# brew 'zsh-autosuggestions'
brew 'curl-openssl'
brew 'python'
brew 'pyenv-virtualenv'
brew 'wget'
brew 'htop'
brew 'podman'
brew 'tor'
# Play, record, convert, and stream audio and video
# brew options homebrew-ffmpeg/ffmpeg/ffmpeg
# brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# https://github.com/aerobounce/homebrew-ffmpeg-fdk-aac ??
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac", "with-libcaca", "with-opencore-amr", "with-openjpeg", "with-openssl", "with-rtmpdump", "with-speex"]

brew "tree"
brew "watch"
brew "graphviz"
brew 'grep'
brew 'coreutils'
brew 'golang'
brew 'kind'
brew 'kubeseal'
brew 'helm'
brew 'awscli@1'
brew 'mongodb-community@5.0'
brew 'tmuxinator'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'hcloud'
brew 'mailhog'
brew 'fluxcd/tap/flux'
brew 'tea'
brew 'k3sup'
brew 'faas-cli'
brew 'kustomize'
brew 'kubie'
brew 'arp-scan'
brew 'arping'
brew 'bitwarden-cli'
brew 'pwgen'
brew 'yarn'
brew 'mutt'
brew 'rbenv'
brew 'tfenv'
brew 'yt-dlp'
brew 'weaveworks/tap/eksctl'
brew 'bun'

# Casks
# cask '1password'
cask 'resilio-sync'
cask 'joplin'
cask 'hammerspoon'
cask 'karabiner-elements'
# cask 'alfred'
# cask 'lens'
cask 'mos'
cask 'sonos'
# cask 'arq'
cask 'textmate'
cask 'xquartz'
cask 'slack'
cask 'visual-studio-code'
cask 'viscosity'
cask 'sensiblesidebuttons'
cask 'firefox'
cask 'google-chrome'
cask 'dropbox'
cask 'zoom'
cask 'keycastr'
cask 'electrum'
cask 'google-cloud-sdk'
cask 'whatsapp'
cask 'docker'
# cask 'robo-3t'
cask 'studio-3t'
cask 'sourcetree'
cask 'vlc'
cask 'balenaetcher'
cask 'audacity'
# cask 'virtualbox'
# cask 'vagrant'
cask 'licecap'
cask 'sequel-ace'
cask 'drawio'
cask 'calibre'
# cask 'vagrant-manager'
cask 'microsoft-edge'
# cask 'microsoft-office'
# cask 'microsoft-teams'
# cask 'vmware-fusion'
# cask 'brave-browser'
# cask 'microsoft-edge'
# cask 'coconutbattery'
# cask 'atemosc'
# cask 'meld'
cask 'obsidian'
cask 'raycast'
# cask 'mactex'
cask 'skim'
# cask 'google-chrome-canary'
# cask 'keybase'
cask 'nheko'
cask 'sparrow'
cask 'tailscale'
# cask 'openaudible'
cask 'stats'
cask 'vscodium'

# Mac App Store
mas "Cloud Mounter", id: 1130254674
mas "Notability", id: 360593530
mas "Pixelmater Pro", id: 1289583905
mas "Blue Wallet", id: 1376878040
mas "Hush Nag Blocker", id: 1544743900
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
# mas "Ultimate Pen", id: 405383991
mas "Screen Brush", id: 1233965871
mas "Davinci Resolve", id: 571213070
mas "Adguard for Safari", id: 1440147259
mas "Final Cut Pro", id: 424389933
mas "Bitwarden", id: 1352778147
mas "ups-power-monitor", id: 1500180529
mas "fully-noded-desktop", id: 1530816100
mas "menu-bar-controller-for-sonos", id: 1357379892
mas "vimeo-video-management", id: 1356686763

mas "gordian-seed-tool", id: 1545088229
# mas "mousepose", id: 405904955
mas "inshort", id: 856124300
mas "bettersnaptool", id: 417375580
mas "languagetool-grammar-checker", id: 1534275760
