# Brewfile

# Taps
tap 'homebrew/cask-drivers'
tap 'thoughtbot/formulae'
tap 'homebrew-ffmpeg/ffmpeg'

# Packages
brew 'git'
brew 'diff-so-fancy'
cask 'brave-browser'
cask 'coconutbattery'
brew 'iperf3'
brew 'jq'
brew 'k9s'
brew 'tldr'
brew 'yubico-piv-tool'
brew 'mas'
brew 'rcm'
brew 'nvm'
brew 'grc'
brew 'duti'
brew 'webp'
brew 'kubectx'
brew 'nvm'
brew 'autojump'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'curl'
brew 'python'
brew 'wget'
brew 'htop'
# Play, record, convert, and stream audio and video
# brew options homebrew-ffmpeg/ffmpeg/ffmpeg
# brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# https://github.com/aerobounce/homebrew-ffmpeg-fdk-aac ??
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac", "with-libcaca", "with-opencore-amr", "with-openjpeg", "with-openssl", "with-rtmpdump", "with-speex"]

brew "tree"
brew "watch"
brew "youtube-dl"
brew "graphviz"

# Casks
cask '1password'
cask 'resilio-sync'
cask 'joplin'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'alfred'
cask 'lens'
cask 'mos'
cask 'sonos'
cask 'arq'
cask 'xquartz'
cask '1password'
cask 'alfred'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'resilio-sync'
cask 'joplin'
cask 'slack'
cask 'visual-studio-code'
cask 'viscosity'
cask 'sensiblesidebuttons'
cask 'firefox'
cask 'google-chrome'
cask 'dropbox'
cask 'zoom'
cask 'keycastr'
cask 'electrum'
cask 'google-cloud-sdk'
cask 'whatsapp'
cask 'docker'
cask 'robo-3t'
cask 'sourcetree'
cask 'vlc'
cask 'balenaetcher'
# cask 'microsoft-office'
# cask 'microsoft-teams'
# cask 'vmware-fusion'

# Mac App Store
mas "Cloud Mounter", id: 1130254674
mas "Notability", id: 360593530
mas "Pixelmater Pro", id: 1289583905
mas "Blue Wallet", id: 1376878040
mas "Hush Nag Blocker", id: 1544743900
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
mas "Ultimate Pen", id: 405383991
